Public Member Functions | List of all members
ACAPI::MEP::TakeOff::Modifier Class Reference
MEP Element Manager
Modifier of the TakeOff. More...
#include <MEPTakeOff.hpp>
 Inheritance diagram for ACAPI::MEP::TakeOff::Modifier:
 Public Member Functions
void  | SetLength (double length)
Sets the length of the Take-off.
Result< void >  | Inject (const TakeOffDefault &TakeOffDefault)
Injects the Default settings into the Take-off.
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
Modifier (ModifiableElementBase &parent)
Constructs a Modifier with the parent ModifiableElementBase.
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the TakeOff.
Member Function Documentation
◆ Inject()
 Result< void > ACAPI::MEP::TakeOff::Modifier::Inject  |  ( |  const TakeOffDefault & |  TakeOffDefault | )
Injects the Default settings into the Take-off.
Parameters
TakeOffDefault | The Default what will be injected. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ SetLength()
 void ACAPI::MEP::TakeOff::Modifier::SetLength  |  ( |  double |  length | )
Sets the length of the Take-off.
Parameters
length | The new length of the Take-off in meters